---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.VerticalLayerExtensionFailureError
source: html/f1a80840-7c02-8e21-01d9-fecaa1099139.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.VerticalLayerExtensionFailureError Property

Cannot extend layer(s) of the highlighted vertically compound wall.

## Syntax (C#)
```csharp
public static FailureDefinitionId VerticalLayerExtensionFailureError { get; }
```